---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.PathOfTravelFailures
source: html/fc5151f2-4f89-12f3-35d9-195925a3b86b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.PathOfTravelFailures

Failures about PathOfTravel.

## Syntax (C#)
```csharp
public static class PathOfTravelFailures
```